src/InformationRegisters/ИТСервисы_СостоянияЛицензий/ИТСервисы_СостоянияЛицензий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИТСервисы_СостоянияЛицензий</name>
  <resources>
    <name>ДнейДоОкончания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Лицензия</name>
    <type>
      <types>CatalogRef.ИТСервисы_ЛицензииПО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/ИТСервисы_ОбновлениеЛицензийСервер/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ОбновитьДниДоОкончанияЛицензий() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИТСервисы_ЛицензииПО.Ссылка КАК Лицензия,
		|	ИТСервисы_ЛицензииПО.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	Справочник.ИТСервисы_ЛицензииПО КАК ИТСервисы_ЛицензииПО
		|ГДЕ
		|	ИТСервисы_ЛицензииПО.ДатаОкончания <> ЗНАЧЕНИЕ(Дата, '00010101')";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	СекундВДне = 86400;
	ТекущаяДата = ТекущаяДатаСеанса();
	
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ИТСервисы_СостоянияЛицензий.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Лицензия.Установить(Выборка.Лицензия);
		НаборЗаписей.Прочитать();
		
		ДнейДоОкончания = (Выборка.ДатаОкончания - ТекущаяДата) / СекундВДне;
		
		Если НаборЗаписей.Количество() = 0 Тогда
			
			ЗаписьРегистра = НаборЗаписей.Добавить();
			ЗаписьРегистра.Лицензия = Выборка.Лицензия;
			ЗаписьРегистра.ДнейДоОкончания = ДнейДоОкончания;
			
		Иначе
			
			ЗаписьРегистра = НаборЗаписей[0];
			ЗаписьРегистра.ДнейДоОкончания = ДнейДоОкончания;
			
		КонецЕсли;
		
		НаборЗаписей.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
